MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_i2s.h
/* I2S_CPU_INT_ISET Bits */
/* I2S_CPU_INT_ISET[WCLKERR] Bits */
#define I2S_CPU_INT_ISET_WCLKERR_OFS             (0)                             /* !< WCLKERR Offset */
#define I2S_CPU_INT_ISET_WCLKERR_MASK            ((uint32_t)0x00000001U)         /* !< This field sets the interrupt
                                                                                    WCLKERR */
#define I2S_CPU_INT_ISET_WCLKERR_NOEFF           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_CPU_INT_ISET_WCLKERR_SET             ((uint32_t)0x00000001U)         /* !< Set interrupt */
/* I2S_CPU_INT_ISET[RXINT] Bits */
#define I2S_CPU_INT_ISET_RXINT_OFS               (1)                             /* !< RXINT Offset */
#define I2S_CPU_INT_ISET_RXINT_MASK              ((uint32_t)0x00000002U)         /* !< Set Receive Interrupt. */
#define I2S_CPU_INT_ISET_RXINT_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_CPU_INT_ISET_RXINT_SET               ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* I2S_CPU_INT_ISET[TXINT] Bits */
#define I2S_CPU_INT_ISET_TXINT_OFS               (2)                             /* !< TXINT Offset */
#define I2S_CPU_INT_ISET_TXINT_MASK              ((uint32_t)0x00000004U)         /* !< Set Transmit Interrupt. */
#define I2S_CPU_INT_ISET_TXINT_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_CPU_INT_ISET_TXINT_SET               ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* I2S_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define I2S_CPU_INT_ISET_DMA_DONE_RX_OFS         (15)                            /* !< DMA_DONE_RX Offset */
#define I2S_CPU_INT_ISET_DMA_DONE_RX_MASK        ((uint32_t)0x00008000U)         /* !< Set DMA Done on RX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_CPU_INT_ISET_DMA_DONE_RX_SET         ((uint32_t)0x00008000U)         /* !< Set Interrupt */
/* I2S_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define I2S_CPU_INT_ISET_DMA_DONE_TX_OFS         (16)                            /* !< DMA_DONE_TX Offset */
#define I2S_CPU_INT_ISET_DMA_DONE_TX_MASK        ((uint32_t)0x00010000U)         /* !< Set DMA Done on TX Event Channel
                                                                                    Interrupt */
#define I2S_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_CPU_INT_ISET_DMA_DONE_TX_SET         ((uint32_t)0x00010000U)         /* !< Set Interrupt */
/* I2S_CPU_INT_ISET[RXFIFO_OVF] Bits */
#define I2S_CPU_INT_ISET_RXFIFO_OVF_OFS          (3)                             /* !< RXFIFO_OVF Offset */
#define I2S_CPU_INT_ISET_RXFIFO_OVF_MASK         ((uint32_t)0x00000008U)         /* !< Set RXFIFO overflow event. */
#define I2S_CPU_INT_ISET_RXFIFO_OVF_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_CPU_INT_ISET_RXFIFO_OVF_SET          ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* I2S_CPU_INT_ISET[TXFIFO_UNF] Bits */
#define I2S_CPU_INT_ISET_TXFIFO_UNF_OFS          (4)                             /* !< TXFIFO_UNF Offset */
#define I2S_CPU_INT_ISET_TXFIFO_UNF_MASK         ((uint32_t)0x00000010U)         /* !< Set TX FIFO Underflow Event */
#define I2S_CPU_INT_ISET_TXFIFO_UNF_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define I2S_CPU_INT_ISET_TXFIFO_UNF_SET          ((uint32_t)0x00000010U)         /* !< Set interrupt */

/* I2S_ICLR Bits */
/* I2S_ICLR[WCLKERR] Bits */
#define I2S_ICLR_WCLKERR_OFS                     (0)                             /* !< WCLKERR Offset */
#define I2S_ICLR_WCLKERR_MASK                    ((uint32_t)0x00000001U)         /* !< This field clears the interrupt
                                                                                    WCLKERR */
#define I2S_ICLR_WCLKERR_NOEFF                   ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_ICLR_WCLKERR_CLR                     ((uint32_t)0x00000001U)         /* !< Clear interrupt */
/* I2S_ICLR[RXINT] Bits */
#define I2S_ICLR_RXINT_OFS                       (1)                             /* !< RXINT Offset */
#define I2S_ICLR_RXINT_MASK                      ((uint32_t)0x00000002U)         /* !< Clear Receive Interrupt. */
#define I2S_ICLR_RXINT_NO_EFFECT                 ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_ICLR_RXINT_CLR                       ((uint32_t)0x00000002U)         /* !< Clear Interrupt */
/* I2S_ICLR[TXINT] Bits */
#define I2S_ICLR_TXINT_OFS                       (2)                             /* !< TXINT Offset */
#define I2S_ICLR_TXINT_MASK                      ((uint32_t)0x00000004U)         /* !< Clear Transmit Interrupt. */
#define I2S_ICLR_TXINT_NO_EFFECT                 ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_ICLR_TXINT_CLR                       ((uint32_t)0x00000004U)         /* !< Clear Interrupt */
/* I2S_ICLR[DMA_DONE_RX] Bits */
#define I2S_ICLR_DMA_DONE_RX_OFS                 (15)                            /* !< DMA_DONE_RX Offset */
#define I2S_ICLR_DMA_DONE_RX_MASK                ((uint32_t)0x00008000U)         /* !< Clear DMA Done on RX Event Channel
                                                                                    Interrupt */
#define I2S_ICLR_DMA_DONE_RX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_ICLR_DMA_DONE_RX_CLR                 ((uint32_t)0x00008000U)         /* !< Clear Interrupt */
/* I2S_ICLR[DMA_DONE_TX] Bits */
#define I2S_ICLR_DMA_DONE_TX_OFS                 (16)                            /* !< DMA_DONE_TX Offset */
#define I2S_ICLR_DMA_DONE_TX_MASK                ((uint32_t)0x00010000U)         /* !< Clear DMA Done on TX Event Channel
                                                                                    Interrupt */
#define I2S_ICLR_DMA_DONE_TX_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define I2S_ICLR_DMA_DONE_TX_CLR                 ((uint32_t)0x00010000U)         /* !< Clear Interrupt */
/* I2S_ICLR[RXFIFO_OVF] Bits */
#define I2S_ICLR_RXFIFO_OVF_OFS                  (3)                             /* !< RXFIFO_OVF Offset */
#define I2S_ICLR_RXFIFO_OVF_MASK                 ((uint32_t)0x00000008U)         /* !< Clear RXFIFO overflow event. */
#define I2S_ICLR_RXFIFO_OVF_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S_ICLR_RXFIFO_OVF_CLR                  ((uint32_t)0x00000008U)         /* !< Clear Interrupt */
/* I2S_ICLR[TXFIFO_UNF] Bits */
#define I2S_ICLR_TXFIFO_UNF_OFS                  (4)                             /* !< TXFIFO_UNF Offset */
#define I2S_ICLR_TXFIFO_UNF_MASK                 ((uint32_t)0x00000010U)         /* !< Clear TXFIFO underflow event */
#define I2S_ICLR_TXFIFO_UNF_NO_EFFECT            ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define I2S_ICLR_TXFIFO_UNF_CLR                  ((uint32_t)0x00000010U)         /* !< Clear interrupt */

